{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "we are the singularity",
	"language": "en",
	"home_page_url": "https://example.com/",
	"feed_url": "https://example.com/feed/feed.json",
	"description": "Noob learns things.",
	"author": {
		"name": "Your Name Here",
		"url": "https://example.com/about-me/"
	},
	"items": [
		{
			"id": "https://example.com/blog/week1.5/initial-research/",
			"url": "https://example.com/blog/week1.5/initial-research/",
			"title": "Understanding Limitations and Implications",
			"content_html": "<h1 id=\"devlog-week-1-5\" tabindex=\"-1\">Devlog - Week 1.5 <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h1>\n<p><picture><source type=\"image/avif\" srcset=\"https://example.com/img/4b3Yy-wkQz-600.avif 600w\"><source type=\"image/webp\" srcset=\"https://example.com/img/4b3Yy-wkQz-600.webp 600w\"><img alt=\"DALL-E generated image of initial research\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/4b3Yy-wkQz-600.png\" width=\"600\" height=\"600\"></picture></p>\n<h2 id=\"short-update\" tabindex=\"-1\">Short Update <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h2>\n<p>A lot has happened and almost two months has passed by. The high energy I had to start the project was zapped by almost 2 weeks of horrible covid. Then I went home to the Philippines to spend the holiday with friends and family. Since I came back to Germany, I haven’t been able to settle into my previous rhythm and normal flow.</p>\n<p>But now I’m getting back to it. I’m also sharing here some tidbits of what I’ve been up to regarding the project. I did some initial research, very surface level things and it allowed me to calibrate my expectations a bit better. The project remains dreamy though. 🤭</p>\n<h2 id=\"llm-limitations\" tabindex=\"-1\">LLM Limitations <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h2>\n<p>Part of the initial research was to understand some of the limitations of current LLMs especially in respect to my project. The most concerning is probably between <em>Understanding Context</em> and the <em>Lack of Intuition/Emotion</em>.</p>\n<p>LLMs are good at pattern recognition but may struggle with complex contexts or nuanced scenarios. This means that two similar situations with slight variations may lead to different interpretations or actions for a human that can identify such nuances.</p>\n<p>The lack of human intuition or emotional understanding kind of falls in the same umbrella. The trained model answers without variations depending on mood like a human would. This can perhaps be alleviated by including emotions by being explicitly verbose on the current state and including it in the training data.</p>\n<h2 id=\"simulation-software\" tabindex=\"-1\">Simulation Software <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h2>\n<p>Exploring different options from games to a custom created world allowed me to pull myself back in to what my goal was. I realized that having the ICF integrated into a simulated environment might be another project in of itself. Thus I decided that perhaps the best environment to observe the model is simply a text-based simulation powered by GPT 4.</p>\n<p>This decision takes away so much work and effort, allowing me to refine and iterate on the ICF quickly and allows me to focus on the things that matters more.</p>\n<h2 id=\"ethical-implications\" tabindex=\"-1\">Ethical Implications <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h2>\n<p>Honestly speaking doing a research on ethical implications, even though it was just for a quick time, was a drag. I had such strong bias against it believing that such things limits growth and discovery. But I managed to force myself with the mindset of just getting it done, and boy I was glad I did it.</p>\n<p>Doing so allowed me to gain a more profound understanding of what simulating consciousness entails, more than data collection or privacy. Questions like “will turning off an AI that is conscious count as murder?” piqued my interest. Such ethical and moral dilemmas are complex especially with such implications. What’s more is the almost paradoxical nature of it; conscious AI and consciousness research will allow us to understand more our own consciousness and how to handle safe guards better.</p>\n<p>In the end, I stand by my stance though. It’s premature to think about such things. My objectives and methodology entails me to discover by doing, and such I decided to be wary of this and learn as I tackle the project.</p>\n<h2 id=\"tools-and-platform\" tabindex=\"-1\">Tools and Platform <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h2>\n<p>As for the tools and platform I decided to make use of open sourced LLM models. I’m leaning more into the Mixtral 7b for now. The data collection will have to come first though, and for this I’ll just use a custom GPT 4 with instructions to simulate a text-based world. I did some initial run and I think GPT 4 is somewhat capable of providing this.</p>\n<p>Lastly, I was choosing between different blog platforms to publish this dev logs. I settled in using Github pages and Eleventy, a JS package to generate static pages quickly. I’m not planning on looking for readers for now, especially at this early stage. It’s probably better to do that when I have more context and a more concrete project.</p>\n<h2 id=\"what-s-next\" tabindex=\"-1\">What’s next? <a class=\"header-anchor\" href=\"https://example.com/blog/week1.5/initial-research/\">#</a></h2>\n<p>As per my time table, next week will be more of an initial planning. Creating a initial project roadmap, resource allocation planning, and probably some advanced research on LLMs. I think I will probably start as well playing around with custom GPTs to enable data collection.</p>\n",
			"date_published": "2024-02-10T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/week1/shared-consciousness/",
			"url": "https://example.com/blog/week1/shared-consciousness/",
			"title": "Integrated Consciousness Framework",
			"content_html": "<h1 id=\"devlog-week-1\" tabindex=\"-1\">Devlog - Week 1 <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h1>\n<p><picture><source type=\"image/avif\" srcset=\"https://example.com/img/BhaZpTI_ha-600.avif 600w\"><source type=\"image/webp\" srcset=\"https://example.com/img/BhaZpTI_ha-600.webp 600w\"><img alt=\"DALL-E generated imaged of ICF\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/BhaZpTI_ha-600.png\" width=\"600\" height=\"600\"></picture></p>\n<h2 id=\"and-there-was-light\" tabindex=\"-1\">And there was light <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h2>\n<p>Cringey titles aside, this is my attempt to publish something to develop the habit of blogging. There’s a project I’ve been meaning to start and I’ll use this devlog to hold myself accountable to seeing the project through. But before I talk about said project, let me first talk about myself.</p>\n<p>I’m Eduard. A Senior Software Engineer at a mattress company that happened to have an internal team to build and maintain their own e-commerce store. To be honest, I see myself as more of a glorified CRUD developer rather than a Software Engineer, let alone a senior one. I will spare the long unnecessary back story, I’m just a curious developer who wants to learn.</p>\n<h2 id=\"exploring-ai-and-machine-learning-through-simulating-shared-consciousness-with-personalized-language-models\" tabindex=\"-1\">Exploring AI and Machine Learning Through Simulating Shared Consciousness with Personalized Language Models <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h2>\n<p>As mentioned, I want to learn more AI. And I want to do this by tackling a project with hands-on practical implementation.</p>\n<h3 id=\"concept-overview\" tabindex=\"-1\">Concept Overview <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>This project conceptualizes consciousness as a functional 'black box' within humans, processing inputs such as environmental stimuli, emotions, and psychological states to produce discernible actions. We propose an &quot;Integrated Consciousness Framework&quot; (ICF), where consciousness can be extended and integrated with non-conscious entities, enabling the control of their actions akin to those of a conscious being.</p>\n<h3 id=\"core-principle\" tabindex=\"-1\">Core Principle <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>In ICF, an 'Integrator' extends their consciousness to a non-conscious entity, such as a character in a game or novel. This extension enables the Integrator to define and drive the actions of these entities, effectively creating a bridge between conscious intent and non-conscious execution.</p>\n<h3 id=\"transient-nature-of-integration\" tabindex=\"-1\">Transient Nature of Integration <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>The integrated consciousness persists only as long as the Integrator actively engages with the non-conscious entity. For example, a novelist imbues a character with purpose and action through writing. Similarly, a gamer instills consciousness into a game character by controlling it. The integration is suspended when the Integrator disengages, pauses, or ceases interaction, reverting the entity to a non-conscious state.</p>\n<h3 id=\"role-of-large-language-models-llms\" tabindex=\"-1\">Role of Large Language Models (LLMs) <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>LLMs serve as facilitators in this framework, automating the integration process. By processing a wide array of inputs and producing coherent outputs, LLMs can maintain a constant state of integrated consciousness for created characters or entities. This system ensures that these entities possess an ongoing, albeit artificial, consciousness as long as they are under the LLM's operation.</p>\n<h3 id=\"objectives\" tabindex=\"-1\">Objectives <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<h3 id=\"1-learning-through-development-and-experimentation\" tabindex=\"-1\">1. Learning Through Development and Experimentation <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Goal</strong>: Utilize the project as a hands-on learning experience in AI and machine learning, focusing on the hypothesis that consciousness can be shared with non-conscious entities.</li>\n<li><strong>Method</strong>: Implement and experiment with various AI techniques and models, using the project as a practical testbed for learning.</li>\n</ul>\n<h3 id=\"2-data-collection-and-personalized-model-training\" tabindex=\"-1\">2. Data Collection and Personalized Model Training <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Focus</strong>: Gather a diverse set of scenarios and responses to train a personalized language model (LLM).</li>\n<li><strong>Process</strong>: Use these responses to fine-tune the LLM, aiming to simulate decision-making processes similar to those of a human.</li>\n</ul>\n<h3 id=\"3-simulation-integration-and-response-analysis\" tabindex=\"-1\">3. Simulation Integration and Response Analysis <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Aim</strong>: Integrate the trained LLM into a simulated environment (such as a game) and analyze its decision-making capabilities.</li>\n<li><strong>Strategy</strong>: Observe how the LLM's responses in the simulation align with expected human decisions, refining the model based on these insights.</li>\n</ul>\n<h3 id=\"4-ethical-considerations-and-responsible-ai-use\" tabindex=\"-1\">4. Ethical Considerations and Responsible AI Use <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Responsibility</strong>: Address ethical concerns related to AI, particularly in simulating consciousness and decision-making.</li>\n<li><strong>Approach</strong>: Ensure responsible and private use of data, and reflect on the broader ethical implications of the project.</li>\n</ul>\n<h3 id=\"5-documenting-the-learning-journey\" tabindex=\"-1\">5. Documenting the Learning Journey <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Commitment</strong>: Maintain a detailed development log (devlog) throughout the project to document challenges, breakthroughs, and learning points.</li>\n<li><strong>Output</strong>: Share this documentation on the blog to provide insights into the project's progress and learnings.</li>\n</ul>\n<h3 id=\"6-success-metrics-knowledge-acquisition-and-practical-application\" tabindex=\"-1\">6. Success Metrics: Knowledge Acquisition and Practical Application <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Evaluation</strong>: Measure the project's success based on the depth and breadth of AI and machine learning knowledge acquired, and the effectiveness of its practical application in the simulated environment.</li>\n</ul>\n<h3 id=\"steps\" tabindex=\"-1\">Steps <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ol>\n<li><strong>Collect Data and Training Set</strong>: Generate a variety of scenarios using GPT-4 to create a realistic word-based simulation. Respond to these scenarios personally to create a training set.</li>\n<li><strong>Fine-Tune the LLM Model</strong>: Adjust the LLM to generate responses that mimic the human's (my) answers. Cross-check these with actual human data to improve performance.</li>\n<li><strong>Simulation Integration</strong>: Choose or create a game and develop a system (possibly NLU) to translate dialog into real actions in this world. This system should also translate in-game events into dialog that the LLM can process, potentially using another fine-tuned LLM for translation.</li>\n</ol>\n<p><em><strong>Note</strong>: the simulation doesn’t need to be real-time. This flexibility allows for reduced complexity and non-linear interaction with the simulated world. Making it more akin to a movie than a game.</em> 4. <strong>Project Outcome</strong>: The end goal is a system that can exist in a &quot;simulated world,&quot; with interaction capabilities based on the training data and programming.</p>\n",
			"date_published": "2023-12-23T00:00:00Z"
		}
		
	]
}
