{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "we are the singularity",
	"language": "en",
	"home_page_url": "https://example.com/",
	"feed_url": "https://example.com/feed/feed.json",
	"description": "Noob learns things.",
	"author": {
		"name": "Your Name Here",
		"url": "https://example.com/about-me/"
	},
	"items": [
		{
			"id": "https://example.com/blog/week1/shared-consciousness/",
			"url": "https://example.com/blog/week1/shared-consciousness/",
			"title": "",
			"content_html": "<h1 id=\"devlog-week-1\" tabindex=\"-1\">Devlog - Week 1 <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h1>\n<p><picture><source type=\"image/avif\" srcset=\"https://example.com/img/BhaZpTI_ha-600.avif 600w\"><source type=\"image/webp\" srcset=\"https://example.com/img/BhaZpTI_ha-600.webp 600w\"><img alt=\"DALL-E generated imaged of ICF\" loading=\"lazy\" decoding=\"async\" src=\"https://example.com/img/BhaZpTI_ha-600.png\" width=\"600\" height=\"600\"></picture></p>\n<h2 id=\"and-there-was-light\" tabindex=\"-1\">And there was light <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h2>\n<p>Cringey titles aside, this is my attempt to publish something to develop the habit of blogging. There’s a project I’ve been meaning to start and I’ll use this devlog to hold myself accountable to seeing the project through. But before I talk about said project, let me first talk about myself.</p>\n<p>I’m Eduard. A Senior Software Engineer at a mattress company that happened to have an internal team to build and maintain their own e-commerce store. To be honest, I see myself as more of a glorified CRUD developer rather than a Software Engineer, let alone a senior one. I will spare the long unnecessary back story, I’m just a curious developer who wants to learn.</p>\n<h2 id=\"exploring-ai-and-machine-learning-through-simulating-shared-consciousness-with-personalized-language-models\" tabindex=\"-1\">Exploring AI and Machine Learning Through Simulating Shared Consciousness with Personalized Language Models <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h2>\n<p>As mentioned, I want to learn more AI. And I want to do this by tackling a project with hands-on practical implementation.</p>\n<h3 id=\"concept-overview\" tabindex=\"-1\">Concept Overview <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>This project conceptualizes consciousness as a functional 'black box' within humans, processing inputs such as environmental stimuli, emotions, and psychological states to produce discernible actions. We propose an &quot;Integrated Consciousness Framework&quot; (ICF), where consciousness can be extended and integrated with non-conscious entities, enabling the control of their actions akin to those of a conscious being.</p>\n<h3 id=\"core-principle\" tabindex=\"-1\">Core Principle <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>In ICF, an 'Integrator' extends their consciousness to a non-conscious entity, such as a character in a game or novel. This extension enables the Integrator to define and drive the actions of these entities, effectively creating a bridge between conscious intent and non-conscious execution.</p>\n<h3 id=\"transient-nature-of-integration\" tabindex=\"-1\">Transient Nature of Integration <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>The integrated consciousness persists only as long as the Integrator actively engages with the non-conscious entity. For example, a novelist imbues a character with purpose and action through writing. Similarly, a gamer instills consciousness into a game character by controlling it. The integration is suspended when the Integrator disengages, pauses, or ceases interaction, reverting the entity to a non-conscious state.</p>\n<h3 id=\"role-of-large-language-models-llms\" tabindex=\"-1\">Role of Large Language Models (LLMs) <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<p>LLMs serve as facilitators in this framework, automating the integration process. By processing a wide array of inputs and producing coherent outputs, LLMs can maintain a constant state of integrated consciousness for created characters or entities. This system ensures that these entities possess an ongoing, albeit artificial, consciousness as long as they are under the LLM's operation.</p>\n<h3 id=\"objectives\" tabindex=\"-1\">Objectives <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<h3 id=\"1-learning-through-development-and-experimentation\" tabindex=\"-1\">1. Learning Through Development and Experimentation <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Goal</strong>: Utilize the project as a hands-on learning experience in AI and machine learning, focusing on the hypothesis that consciousness can be shared with non-conscious entities.</li>\n<li><strong>Method</strong>: Implement and experiment with various AI techniques and models, using the project as a practical testbed for learning.</li>\n</ul>\n<h3 id=\"2-data-collection-and-personalized-model-training\" tabindex=\"-1\">2. Data Collection and Personalized Model Training <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Focus</strong>: Gather a diverse set of scenarios and responses to train a personalized language model (LLM).</li>\n<li><strong>Process</strong>: Use these responses to fine-tune the LLM, aiming to simulate decision-making processes similar to those of a human.</li>\n</ul>\n<h3 id=\"3-simulation-integration-and-response-analysis\" tabindex=\"-1\">3. Simulation Integration and Response Analysis <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Aim</strong>: Integrate the trained LLM into a simulated environment (such as a game) and analyze its decision-making capabilities.</li>\n<li><strong>Strategy</strong>: Observe how the LLM's responses in the simulation align with expected human decisions, refining the model based on these insights.</li>\n</ul>\n<h3 id=\"4-ethical-considerations-and-responsible-ai-use\" tabindex=\"-1\">4. Ethical Considerations and Responsible AI Use <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Responsibility</strong>: Address ethical concerns related to AI, particularly in simulating consciousness and decision-making.</li>\n<li><strong>Approach</strong>: Ensure responsible and private use of data, and reflect on the broader ethical implications of the project.</li>\n</ul>\n<h3 id=\"5-documenting-the-learning-journey\" tabindex=\"-1\">5. Documenting the Learning Journey <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Commitment</strong>: Maintain a detailed development log (devlog) throughout the project to document challenges, breakthroughs, and learning points.</li>\n<li><strong>Output</strong>: Share this documentation on the blog to provide insights into the project's progress and learnings.</li>\n</ul>\n<h3 id=\"7-success-metrics-knowledge-acquisition-and-practical-application\" tabindex=\"-1\">7. Success Metrics: Knowledge Acquisition and Practical Application <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ul>\n<li><strong>Evaluation</strong>: Measure the project's success based on the depth and breadth of AI and machine learning knowledge acquired, and the effectiveness of its practical application in the simulated environment.</li>\n</ul>\n<h3 id=\"steps\" tabindex=\"-1\">Steps <a class=\"header-anchor\" href=\"https://example.com/blog/week1/shared-consciousness/\">#</a></h3>\n<ol>\n<li><strong>Collect Data and Training Set</strong>: Generate a variety of scenarios using GPT-4 to create a realistic word-based simulation. Respond to these scenarios personally to create a training set.</li>\n<li><strong>Fine-Tune the LLM Model</strong>: Adjust the LLM to generate responses that mimic the human's (my) answers. Cross-check these with actual human data to improve performance.</li>\n<li><strong>Simulation Integration</strong>: Choose or create a game and develop a system (possibly NLU) to translate dialog into real actions in this world. This system should also translate in-game events into dialog that the LLM can process, potentially using another fine-tuned LLM for translation.\n<em>Note: the simulation doesn’t need to be real-time. This flexibility allows for reduced complexity and non-linear interaction with the simulated world. Making it more akin to a movie than a game.</em></li>\n<li><strong>Project Outcome</strong>: The end goal is a system that can exist in a &quot;simulated world,&quot; with interaction capabilities based on the training data and programming.</li>\n</ol>\n",
			"date_published": "2023-12-06T20:43:50Z"
		}
		
	]
}
